# Dotfiles Brewfile
# Install: brew bundle
# Update:  brew bundle dump --force

# =============================================================================
# Taps
# =============================================================================

tap "homebrew/bundle"
tap "buo/cask-upgrade"          # For 'brew cu' cask upgrade command

# =============================================================================
# Core CLI Tools
# =============================================================================

brew "git"                      # Version control
brew "git-filter-repo"          # Advanced git history rewriting
brew "gh"                       # GitHub CLI
brew "stow"                     # Symlink manager
brew "mas"                      # Mac App Store CLI

# =============================================================================
# Shell Enhancement
# =============================================================================

brew "starship"                 # Fast, customizable prompt
brew "zsh-autosuggestions"      # Fish-like autosuggestions
brew "zsh-syntax-highlighting"  # Syntax highlighting for zsh
brew "zoxide"                   # Smarter cd command
brew "fzf"                      # Fuzzy finder

# =============================================================================
# Modern CLI Replacements
# =============================================================================

brew "bat"                      # Better cat with syntax highlighting
brew "eza"                      # Modern ls replacement
brew "ripgrep"                  # Fast grep (rg)
brew "fd"                       # Fast find
brew "tree"                     # Directory tree view
brew "htop"                     # Better top

# =============================================================================
# Development Tools
# =============================================================================

brew "fnm"                      # Fast Node Manager
brew "pnpm"                     # Fast npm alternative
brew "jq"                       # JSON processor
brew "mkcert"                   # Local SSL certificates
# brew "nss"                    # Required by mkcert for Firefox

# DevOps / Automation
brew "ansible"                  # Automation tool
brew "ansible-lint"             # Ansible playbook linter
brew "pre-commit"               # Git hooks framework
brew "yamllint"                 # YAML linter

# Font Tools
# brew "fonttools"              # Font manipulation tools
# brew "sfnt2woff"              # WOFF font converter
# tap "bramstein/webfonttools"
# brew "bramstein/webfonttools/sfnt2woff-zopfli" # WOFF font converter with Zopfli compression
# brew "woff2"                  # WOFF2 font converter

# =============================================================================
# Cask Applications
# =============================================================================

# -----------------------------------------------------------------------------
# Terminals
# -----------------------------------------------------------------------------
cask "iterm2"                   # Feature-rich terminal
cask "warp"                     # Modern AI terminal

# -----------------------------------------------------------------------------
# Development
# -----------------------------------------------------------------------------
cask "visual-studio-code"       # Code editor
cask "cursor"                   # AI-powered code editor
cask "codex"                    # AI code assistant
cask "docker"                   # Docker Desktop
cask "fork"                     # Git GUI client
cask "gitkraken"                # Git GUI client

# -----------------------------------------------------------------------------
# Productivity
# -----------------------------------------------------------------------------
cask "1password"                # Password manager
cask "1password-cli"            # 1Password CLI

# -----------------------------------------------------------------------------
# Browsers
# -----------------------------------------------------------------------------
cask "google-chrome"            # Chrome browser
cask "firefox"                  # Firefox browser

# -----------------------------------------------------------------------------
# Communication
# -----------------------------------------------------------------------------
cask "slack"                    # Team communication
cask "discord"                  # Gaming & community chat
cask "whatsapp"                 # Messaging
cask "zoom"                     # Video conferencing

# -----------------------------------------------------------------------------
# Design & Creative
# -----------------------------------------------------------------------------
cask "figma"                    # Design tool
cask "adobe-creative-cloud"     # Adobe suite
cask "rightfont"                # Font manager

# -----------------------------------------------------------------------------
# Project Management
# -----------------------------------------------------------------------------
cask "linear-linear"            # Issue tracking

# -----------------------------------------------------------------------------
# AI Tools
# -----------------------------------------------------------------------------
cask "chatgpt"                  # ChatGPT desktop app

# -----------------------------------------------------------------------------
# Writing & Documentation
# -----------------------------------------------------------------------------
cask "grammarly-desktop"        # Writing assistant

# -----------------------------------------------------------------------------
# Media & Entertainment
# -----------------------------------------------------------------------------
cask "iina"                     # Video player
cask "spotify"                  # Music streaming

# -----------------------------------------------------------------------------
# Music Production
# -----------------------------------------------------------------------------
cask "bitwig-studio"            # DAW
cask "elektron-overbridge"      # Elektron device manager
cask "focusrite-control"        # Focusrite interface control
cask "ilok-license-manager"     # iLok license manager
cask "softube-central"          # Softube plugin manager
cask "soundtoys"                # Audio plugins

# -----------------------------------------------------------------------------
# Utilities
# -----------------------------------------------------------------------------
cask "appcleaner"               # App uninstaller
cask "keka"                     # Archive utility
cask "little-snitch"            # Network monitor & firewall
cask "logitech-g-hub"           # Logitech device manager
cask "philips-hue-sync"         # Philips Hue integration
cask "utm"                      # Virtual machines

# =============================================================================
# Fonts
# =============================================================================

cask "font-monaspace"                   # Monaspace font family
cask "font-jetbrains-mono-nerd-font"    # (necessary for Starship prompt icons)
cask "font-fira-code-nerd-font"         # (necessary for Starship prompt icons)

# =============================================================================
# Mac App Store Apps
# =============================================================================

mas "Magnet", id: 441258766             # Window manager
mas "iA Writer", id: 775737590          # Markdown editor
