tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"

brew "ack"
brew "autojump"
brew "bat"
brew "ctop"
# brew "coreutils"
brew "diff-so-fancy"
brew "gh"
brew "git"
brew "autojump"
brew "fzf"
brew "gnupg"
brew "mas"
brew "spaceship"
brew "stow"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"


# fonts 
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-roboto"

# essentials
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "docker"
cask "homebrew/cask-versions/firefox-nightly"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "keka"
cask "little-snitch"
cask "mattermost"
cask "openvpn-connect"
cask "postman"
cask "raycast"
cask "spotify"
cask "tower"
cask "visual-studio-code"

# mac utilities
# cask "appcleaner"
# cask "carbon-copy-cloner"
# cask "istat-menus"
# cask "jettison"
# cask "logitech-g-hub"
# cask "monitorcontrol"
# cask "philips-hue-sync"
# cask "soundsource"

# office
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# communication
# cask "discord"
# cask "gotomeeting"
# cask "messenger"
# cask "whatsapp"
# cask "zoom"

# gaming
# cask "steam"

# music production
# cask "bitwig-studio"
# cask "elektron-transfer"
# cask "ilok-license-manager"
# cask "softube-central"
# cask "soundtoys"

# app store
mas "Magnet", id: 441258766
mas "iA Writer", id: 775737590
