christian-kohler.npm-intellisense
christian-kohler.path-intellisense
clinyong.vscode-css-modules
dbaeumer.vscode-eslint
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
oderwat.indent-rainbow
Orta.vscode-jest
PKief.material-icon-theme
sleistner.vscode-fileutils
Syler.sass-indented
Tyriar.lorem-ipsum
Valiantsin.operatormonodarktheme
vincaslt.highlight-matching-tag