VisualStudioExptTeam.vscodeintellicode
EditorConfig.EditorConfig
dbaeumer.vscode-eslint
esbenp.prettier-vscode
Orta.vscode-jest
eamodio.gitlens
donjayamanne.githistory
PKief.material-icon-theme
oderwat.indent-rainbow
Valiantsin.operatormonodarktheme
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
sleistner.vscode-fileutils
vincaslt.highlight-matching-tag
formulahendry.auto-rename-tag
Zignd.html-css-class-completion
clinyong.vscode-css-modules
csstools.postcss
cpylua.language-postcss
mrmlnc.vscode-scss
mingteo.sort-selection-concentrically	
ms-azuretools.vscode-docker
msjsdiag.debugger-for-chrome
firefox-devtools.vscode-firefox-debug
Tyriar.lorem-ipsum
gera2ld.markmap-vscode
naumovs.color-highlight